run/navalFoam/hullSlammingGraphMotion2D/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          motionProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh    graphSolidMotion;

graphSolidMotionCoeffs
{
    motionCentre   (0 0 0);

    x              zero.dat;
    y              dropVelocity.dat;
    z              zero.dat;

    xRot           zero.dat;
    yRot           zero.dat;
    zRot           zero.dat;

    inDegrees            true;
}


// ************************************************************************* //
