run/navalFoam/hullSlammingGraphMotion2D/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


convertToMeters 1;

vertices
(
    ( 0      -0.4    -0.01)
    ( 0.375  -0.4    -0.01)
    ( 0.75   -0.4    -0.01)

    ( 0      -0.1  -0.01)
    ( 0.375  0.3  -0.01)
    ( 0.75   0.3  -0.01)

    ( 0.375  1     -0.01)
    ( 0.75   1     -0.01)

    (0       0     -0.01)
    (0.275   0.365 -0.01)
    (0.285   1     -0.01)

    ( 0      -0.4     0.01)
    ( 0.375  -0.4     0.01)
    ( 0.75   -0.4     0.01)

    ( 0      -0.1   0.01)
    ( 0.375  0.3   0.01)
    ( 0.75   0.3   0.01)

    ( 0.375  1      0.01)
    (  0.75  1      0.01)

    (0       0      0.01)
    (0.275   0.365  0.01)
    (0.285   1      0.01)

    ( 0      -1      -0.01)
    ( 0.375  -1      -0.01)
    ( 0.75   -1      -0.01)

    ( 0      -1       0.01)
    ( 0.375  -1       0.01)
    ( 0.75   -1       0.01)

);

blocks
(
    hex (0 1 4 3 11 12 15 14) (15 20 1) simpleGrading (1 0.5 1)
    hex (1 2 5 4 12 13 16 15) (15 20 1) simpleGrading (2 0.5 1)
    hex (4 5 7 6 15 16 18 17) (15 15 1) simpleGrading (2 1 1)

    hex (3 4 9 8 14 15 20 19) (15 15 1) simpleGrading (1 0.3 1)
    hex (4 6 10 9 15 17 21 20) (15 15 1) simpleGrading (1 0.3 1)

    hex (22 23 1 0 25 26 12 11) (15 7 1) simpleGrading (1 1 1)
    hex (23 24 2 1 26 27 13 12) (15 7 1) simpleGrading (2 1 1)

);

edges
(
    polyLine 8 9
    (
        (0.0100 0.0038 -0.01)
        (0.0175 0.0093 -0.01)
        (0.0263 0.0190 -0.01)
        (0.0340 0.0298 -0.01)
        (0.0395 0.0392 -0.01)
        (0.0450 0.0500 -0.01)
        (0.0495 0.0600 -0.01)
        (0.0535 0.0700 -0.01)
        (0.0572 0.0803 -0.01)
        (0.0608 0.0911 -0.01)
        (0.0640 0.1009 -0.01)
        (0.0670 0.1101 -0.01)
        (0.0700 0.1190 -0.01)
        (0.0740 0.1300 -0.01)
        (0.0780 0.1400 -0.01)
        (0.0822 0.1494 -0.01)
        (0.0875 0.1600 -0.01)
        (0.0928 0.1694 -0.01)
        (0.0998 0.1804 -0.01)
        (0.1068 0.1900 -0.01)
        (0.1150 0.2000 -0.01)
        (0.1242 0.2102 -0.01)
        (0.1340 0.2202 -0.01)
        (0.1440 0.2298 -0.01)
        (0.1550 0.2400 -0.01)
        (0.1664 0.2502 -0.01)
        (0.1775 0.2600 -0.01)
        (0.1890 0.2700 -0.01)
        (0.2005 0.2800 -0.01)
        (0.2118 0.2900 -0.01)
        (0.2230 0.3001 -0.01)
        (0.2335 0.3097 -0.01)
        (0.2433 0.3190 -0.01)
        (0.2538 0.3300 -0.01)
        (0.2618 0.3400 -0.01)
        (0.2685 0.3503 -0.01)
        (0.2734 0.3600 -0.01)
    )

    polyLine 9 10
    (
        (0.2770 0.3800 -0.01)
        (0.2815 0.4390 -0.01)
        (0.2840 0.5000 -0.01)
        (0.2850 1.0000 -0.01)
    )

    polyLine 19 20
    (
        (0.0100 0.0038  0.01)
        (0.0175 0.0093  0.01)
        (0.0263 0.0190  0.01)
        (0.0340 0.0298  0.01)
        (0.0395 0.0392  0.01)
        (0.0450 0.0500  0.01)
        (0.0495 0.0600  0.01)
        (0.0535 0.0700  0.01)
        (0.0572 0.0803  0.01)
        (0.0608 0.0911  0.01)
        (0.0640 0.1009  0.01)
        (0.0670 0.1101  0.01)
        (0.0700 0.1190  0.01)
        (0.0740 0.1300  0.01)
        (0.0780 0.1400  0.01)
        (0.0822 0.1494  0.01)
        (0.0875 0.1600  0.01)
        (0.0928 0.1694  0.01)
        (0.0998 0.1804  0.01)
        (0.1068 0.1900  0.01)
        (0.1150 0.2000  0.01)
        (0.1242 0.2102  0.01)
        (0.1340 0.2202  0.01)
        (0.1440 0.2298  0.01)
        (0.1550 0.2400  0.01)
        (0.1664 0.2502  0.01)
        (0.1775 0.2600  0.01)
        (0.1890 0.2700  0.01)
        (0.2005 0.2800  0.01)
        (0.2118 0.2900  0.01)
        (0.2230 0.3001  0.01)
        (0.2335 0.3097  0.01)
        (0.2433 0.3190  0.01)
        (0.2538 0.3300  0.01)
        (0.2618 0.3400  0.01)
        (0.2685 0.3503  0.01)
        (0.2734 0.3600  0.01)
    )

    polyLine 20 21
    (
        (0.2770 0.3800  0.01)
        (0.2815 0.4390  0.01)
        (0.2840 0.5000  0.01)
        (0.2850 1.0000  0.01)
    )
);

patches
(
    wall hull
    (
        (8 19 20 9)
        (9 20 21 10)
    )

    symmetryPlane left
    (
        (0 11 14 3)
        (3 14 19 8)
        (22 25 11 0)
    )

    patch right
    (
        (2 5 16 13)
        (5 7 18 16)
        (24 2 13 27)
    )

    patch bottom
    (
        (22 23 26 25)
        (23 24 27 26)
    )

    patch top
    (
        (7 6 17 18)
        (6 10 21 17)
    )

    empty frontAndBack
    (
        // Back
        (0 3 4 1)
        (1 4 5 2)
        (4 6 7 5)
        (3 8 9 4)
        (4 9 10 6)
        (22 0 1 23)
        (23 1 2 24)

        // Front
        (11 12 15 14)
        (12 13 16 15)
        (15 16 18 17)
        (14 15 20 19)
        (15 17 21 20)
        (25 26 12 11)
        (26 27 13 12)
    )
);

mergePatchPairs
();


// ************************************************************************* //
