run/navalFoam/hullSlammingGraphMotion2D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    hull
    {
        type            wall;
        nFaces          30;
        startFace       2883;
    }
    left
    {
        type            symmetryPlane;
        nFaces          42;
        startFace       2913;
    }
    right
    {
        type            patch;
        nFaces          42;
        startFace       2955;
    }
    bottom
    {
        type            patch;
        nFaces          30;
        startFace       2997;
    }
    top
    {
        type            patch;
        nFaces          30;
        startFace       3027;
    }
    frontAndBack
    {
        type            empty;
        nFaces          2970;
        startFace       3057;
    }
)

// ************************************************************************* //
